Juan Pablo Meza

CIS 2532

The purpose of this program is to show the implementation of Big Data in Python. 

This program allows us to access and modify a database file that was created for us.

We will display/modify the contents of the database by doing the following:

~Display the authors last names in Descending Order

~Select all book titles from the Titles Table in ascending order

~Using the INNER JOIN command to select all the books from a specific author

~Insert a new Author into the authors table

~Insert a new title for an author

In [1]:
import sqlite3
import pandas as pd

In [2]:
connection = sqlite3.connect('books.db')

In [3]:
#Ordering the last names from the 'Authors' table by descending order
pd.read_sql('SELECT last FROM authors ORDER BY last DESC', connection)

     last
0    Wald
1   Quirk
2  Deitel
3  Deitel
4  Deitel

In [4]:
#Ordering the book titles from the 'Titles' table by ascending order
pd.read_sql('Select title FROM titles ORDER BY title ASC', connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

In [5]:
#Using an INNER JOIN to select books from a specific author. In this case I will be pulling the titles by 'Paul Deitel' and sorting them alphabetically
pd.read_sql('SELECT title, copyright, titles.isbn FROM titles INNER JOIN author_ISBN ON titles.isbn = author_ISBN.isbn WHERE author_ISBN.id = 1 ORDER BY title ASC', connection)

                              title copyright        isbn
0         Android 6 for Programmers      2016  0134289366
1            Android How to Program      2017  0134444302
2                  C How to Program      2016  0133976890
3                C++ How to Program      2017  0134448235
4     Internet & WWW How to Program      2012  0132151006
5     Intro to Python for CS and DS      2020  0135404673
6               Java How to Program      2018  0134743350
7  Visual Basic 2012 How to Program      2014  0133406954
8          Visual C# How to Program      2017  0134601548
9         Visual C++ How to Program      2008  0136151574

In [6]:
#Inserting a new author into the 'Authors' Table
cursor = connection.cursor()

In [7]:
cursor = cursor.execute("""INSERT INTO authors (first, last) VALUES ('Juan Pablo', 'Meza')""")

In [8]:
pd.read_sql('SELECT id, first, last FROM authors', connection)

   id       first    last
0   1        Paul  Deitel
1   2      Harvey  Deitel
2   3       Abbey  Deitel
3   4         Dan   Quirk
4   5   Alexander    Wald
5   6  Juan Pablo    Meza

In [9]:
#Adding a new title for an author
cursor = cursor.execute("""INSERT INTO author_ISBN (id, isbn) VALUES (6, '0135402357')""")

In [10]:
cursor = cursor.execute("""INSERT INTO titles (isbn, title, edition, copyright) VALUES ('0135402357', 'Juan Pablo Meza: A Biography', 1, '2022')""")

In [11]:
#Displaying the newly created title for the author with the ID '6'
print('Displaying the newly created title for the newly created author')
pd.read_sql('SELECT title FROM titles INNER JOIN author_ISBN ON titles.isbn = author_ISBN.isbn WHERE author_ISBN.id = 6', connection)

Displaying the newly created title for the newly created author

                          title
0  Juan Pablo Meza: A Biography

In [12]:
#Closing the database
connection.close()